Config/Catalogs/Субконто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Субконто</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.ВидыСубконто</xr:Item>
				<xr:Item>ChartOfCharacteristicTypes.АналитикаОтчетов</xr:Item>
				<xr:Item>Catalog.СпискиЗначенийАналитик</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементВладелецКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Субконто/Forms/ПолнаяКлассификация/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		ТекущееЗначениеКлассификатора = Параметры.ТекущаяСтрока;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.ГруппаОтборПоКлассификатору.ТекущаяСтраница = Элементы.ГруппаКлассификатор;
	
	Если ЗначениеЗаполнено(Параметры.ДетальныйВидАналитики)
		И ЗначениеЗаполнено(Параметры.ВидАналитики) Тогда
		// это выбор из ячейки главной аналитики, для которой в выбираемом отчете существует только 1 детальный вид аналитики
		
		ОтборПоКлассификатору = Параметры.ДетальныйВидАналитики;
		ДетализируемыйКлассификатор = Параметры.ВидАналитики;
		
		ЗаполнитьДеревоКлассификатора();
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево;
		
		Элементы.ГруппаОтборПоКлассификатору.ТекущаяСтраница = Элементы.ГруппаДетализируемыйКлассификатор;//когда выбор из владельца
				
		УстановитьОтборПоВладельцу();
	Иначе
		
		Если Параметры.Свойство("ДополнительныйОтбор")
			И ТипЗнч(Параметры.ДополнительныйОтбор) = Тип("Структура") Тогда
			
			Если Параметры.ДополнительныйОтбор.Свойство("ЭлементВладелец") Тогда
				//это выбор из ячейки детальной аналитики, ЭлементВладелец - это значение главной аналитики
				ЗначениеДетализируемогоКлассификатора = Параметры.ДополнительныйОтбор.ЭлементВладелец;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ВидАналитики) Тогда
			ОтборПоКлассификатору = Параметры.ВидАналитики;
		Иначе
			Если Параметры.Отбор.Свойство("Владелец") Тогда
				ОтборПоКлассификатору = Параметры.Отбор.Владелец;
				Параметры.Отбор.Удалить("Владелец");			
			ИначеЕсли ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
				ОтборПоКлассификатору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока,"Владелец");
			КонецЕсли;
		КонецЕсли;
			
		ДетализируемыйКлассификатор = ПланыВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(ОтборПоКлассификатору) Тогда
			
			ДетализируемыйКлассификатор = БюджетнаяОтчетностьСервер.ПолучитьДетализируемыйКлассификаторПоСсылке(ОтборПоКлассификатору);		
			
		КонецЕсли;
		
		УстановитьОтборПоВладельцу();
				
		Если ЗначениеЗаполнено(ДетализируемыйКлассификатор) Тогда
						
			ЗаполнитьДеревоКлассификатора();
			//Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево;
			
		Иначе
			//Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписок;
				
		КонецЕсли;
	
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево Тогда
		Элементы.ФормаВыборЗначенияКлассификатораИзДерева.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.СписокВыборЗначенияКлассификатора.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Код") Тогда
			ДобавитьКнопкуОтборПоПараметруБланка();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЭлементов

&НаКлиенте
Процедура ДеревоЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборЗначения()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево Тогда
	
		ТекДанные = Элементы.ДеревоЭлементов.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураВыбора = Новый Структура;
		
		СоответствиеВыбранныхЗначений = Новый Соответствие;
		ТекРодитель = ТекДанные.ПолучитьРодителя();
		Если ТекРодитель = Неопределено Тогда
			СоответствиеВыбранныхЗначений.Вставить(ДетализируемыйКлассификатор,ТекДанные.Ссылка);
			СоответствиеВыбранныхЗначений.Вставить(ОтборПоКлассификатору,ПредопределенноеЗначение("Справочник.Субконто.ПустаяСсылка"));
		Иначе
			СоответствиеВыбранныхЗначений.Вставить(ДетализируемыйКлассификатор,ТекРодитель.Ссылка);
			СоответствиеВыбранныхЗначений.Вставить(ОтборПоКлассификатору,ТекДанные.Ссылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ДетальныйВидАналитики) Тогда
			//это выбор из поля главной аналитики, поэтому в Ссылку передаем главную аналитику
			СтруктураВыбора.Вставить("Ссылка",СоответствиеВыбранныхЗначений[ДетализируемыйКлассификатор]);
		Иначе
			//это выбор из поля детальной аналитики
			СтруктураВыбора.Вставить("Ссылка",СоответствиеВыбранныхЗначений[ОтборПоКлассификатору]);
		КонецЕсли;
		
		СтруктураВыбора.Вставить("СоответствиеВыбранныхЗначений",СоответствиеВыбранныхЗначений);
		
	Иначе
		//выбор из списка
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураВыбора = Новый Структура;
		СтруктураВыбора.Вставить("Ссылка", ТекДанные.Ссылка);
	КонецЕсли;
	
	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ТекДанные = Элементы.ДеревоЭлементов.ТекущиеДанные;
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	
	 
	Если ТекРодитель = Неопределено Тогда
		ГлавнаяСтрока = ТекДанные;
	Иначе
		ГлавнаяСтрока = ТекРодитель;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Если Копирование = Ложь Тогда
		СтруктураЗаполнения = Новый Структура("ЭлементВладелецКод,Владелец",СокрЛП(ГлавнаяСтрока.Код),ОтборПоКлассификатору);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения",СтруктураЗаполнения);
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
			Возврат;
		Иначе
			ПараметрыФормы.Вставить("ЗначениеКопирования",ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеОп = Новый ОписаниеОповещения("ПослеДобавленияЭлемента",ЭтотОбъект);
	ОткрытьФорму("Справочник.Субконто.Форма.ФормаЭлемента",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияЭлемента(Результат, ДопПараметры) Экспорт
	ЗаполнитьДеревоКлассификатора();	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.ДеревоЭлементов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ОткрытьФорму("Справочник.Субконто.Форма.ФормаЭлемента",Новый Структура("Ключ",ТекДанные.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработатьВыборЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовПередУдалением(Элемент, Отказ)

	Отказ = Истина;
	
	ВыделенныеСтроки = Элемент.ВыделенныеСтроки;
	СчетчикИстина    = 0;
	СчетчикЛожь      = 0;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		ТД = ДеревоЭлементов.НайтиПоИдентификатору(Идентификатор);
		Если ТД.ПометкаУдаления Тогда
			СчетчикИстина = СчетчикИстина + 1;
		Иначе
			СчетчикЛожь   = СчетчикЛожь + 1;
		КонецЕсли;
	КонецЦикла;
	
	ТекущаяПометка  = (СчетчикИстина > СчетчикЛожь);
	ИтоговаяПометка = Не ТекущаяПометка;
	
	ТекстСообщения = ?(ИтоговаяПометка, НСтр("ru = 'Пометить выделенные элементы на удаление?'"), НСтр("ru = 'Снять с выделенных элементов пометку на удаление?'"));
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ДеревоЭлементовПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки, ИтоговаяПометка, ТекстСообщения", ВыделенныеСтроки, ИтоговаяПометка, ТекстСообщения)), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки 	= ДополнительныеПараметры.ВыделенныеСтроки;
    ИтоговаяПометка 	= ДополнительныеПараметры.ИтоговаяПометка;
    ТекстСообщения 		= ДополнительныеПараметры.ТекстСообщения;
    
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        
        ПараметрыНавигационнойСсылки = Неопределено;
        
        КоличествоПомеченных         = УстановитьПометкуУдаления(ВыделенныеСтроки, ИтоговаяПометка, ПараметрыНавигационнойСсылки);
        
        Если ИтоговаяПометка = Истина Тогда
            ТекстСообщения = НСтр("ru = 'Пометка удаления установлена (%1)'");
        Иначе
            ТекстСообщения = НСтр("ru = 'Пометка удаления снята (%1)'");
        КонецЕсли;
        
        Если КоличествоПомеченных <> 1 Тогда
            ПараметрыНавигационнойСсылки = Неопределено;
        КонецЕсли;
        
        ПоказатьОповещениеПользователя(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, КоличествоПомеченных),
	        ?(ПараметрыНавигационнойСсылки = Неопределено, Неопределено, ПараметрыНавигационнойСсылки.НавигационнаяСсылка),
	        ?(ПараметрыНавигационнойСсылки = Неопределено, ЭтаФорма.Заголовок, ПараметрыНавигационнойСсылки.Текст),
	        БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ЗаполнитьДеревоКлассификатора();
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияКлассификатора(Команда)
	ОбработатьВыборЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВид(Команда)
	
	ПереключитьВидКлассификатора();
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьВидКлассификатора()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписок;
		Элементы.СписокВыборЗначенияКлассификатора.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДерево;
		Элементы.ФормаВыборЗначенияКлассификатораИзДерева.КнопкаПоУмолчанию = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоВладельцу()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Владелец",ОтборПоКлассификатору);
	
	ТипВладельца = ТипЗнч(ОтборПоКлассификатору);
	
	НельзяРедактировать = Ложь;
	Если ТипВладельца = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов")
		ИЛИ ТипВладельца = Тип("СправочникСсылка.СпискиЗначенийАналитик") Тогда
		НельзяРедактировать = ОтборПоКлассификатору.ВозможностьРедактированияВПодчиненныхКонфигурациях = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПросмотр = НельзяРедактировать;
КонецПроцедуры // УстановитьОтборПоВладельцу()

&НаКлиенте
Процедура ОтборПоПараметруБланка_Подключаемый()
	
	КнопкаОтборПоПараметруБланка = Элементы.Найти("КнопкаОтборПоПараметруБланка");
	Если НЕ КнопкаОтборПоПараметруБланка = Неопределено Тогда
		КнопкаОтборПоПараметруБланка.Пометка = НЕ КнопкаОтборПоПараметруБланка.Пометка;
		Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код") Тогда
				ЭлементОтбора.Использование = КнопкаОтборПоПараметруБланка.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкуОтборПоПараметруБланка()
	
	КомандаОтборПоПараметруБланка = ЭтаФорма.Команды.Добавить("ОтборПоПараметруБланка");
	КомандаОтборПоПараметруБланка.Действие = "ОтборПоПараметруБланка_Подключаемый";
	КомандаОтборПоПараметруБланка.Подсказка = "Отбор по параметру бланка";
	
	КнопкаОтборПоПараметруБланка = Элементы.Добавить("КнопкаОтборПоПараметруБланка",Тип("КнопкаФормы"),ЭтаФорма.КоманднаяПанель);
	КнопкаОтборПоПараметруБланка.Картинка = БиблиотекаКартинок.ОтборКомпоновкиДанных;
	КнопкаОтборПоПараметруБланка.Отображение = ОтображениеКнопки.Картинка;
	КнопкаОтборПоПараметруБланка.ИмяКоманды = "ОтборПоПараметруБланка";
	КнопкаОтборПоПараметруБланка.Пометка = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоКлассификатора()
		
	Элементы.ФормаПереключитьВид.Видимость = Истина;
	
	ДеревоЭлементов.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Субконто.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Субконто.ПометкаУдаления
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИндексКартинки,
		|	Субконто.Код КАК Код,
		|	Субконто.Наименование КАК Наименование,
		|	Субконто.НаименованиеПолное КАК НаименованиеПолное,
		|	Субконто.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Субконто КАК Субконто
		|ГДЕ
		|	Субконто.Владелец = &ДетализируемыйКлассификатор
		|	И Субконто.ЭтоГруппа = ЛОЖЬ
		|	И ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Субконто.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Субконто.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ИндексКартинки,
		|	Субконто.Код КАК Код,
		|	Субконто.Наименование КАК Наименование,
		|	Субконто.НаименованиеПолное КАК НаименованиеПолное,
		|	Субконто.ЭлементВладелецКод КАК ЭлементВладелецКод,
		|	Субконто.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Субконто КАК Субконто
		|ГДЕ
		|	Субконто.Владелец = &Владелец
		|	И Субконто.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДетализируемыйКлассификатор", ДетализируемыйКлассификатор);
	Запрос.УстановитьПараметр("Владелец", ОтборПоКлассификатору);
	
	СтрокаЗамены = "";
	Если ЗначениеЗаполнено(ЗначениеДетализируемогоКлассификатора) Тогда
		
		Запрос.УстановитьПараметр("ЗначениеДетализируемогоКлассификатора", ЗначениеДетализируемогоКлассификатора);
		СтрокаЗамены = "И Субконто.Ссылка = &ЗначениеДетализируемогоКлассификатора";
		
		//это выбор из детальной аналитики, при этом главная аналитика в отчете уже заполнена
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ИСТИНА", СтрокаЗамены);
		
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаГлавный = РезультатыЗапроса[0].Выбрать();
	
	ИдТекущейСтроки = Неопределено;
	
	СоответствиеКодовСтрок = Новый Соответствие;
	Пока ВыборкаГлавный.Следующий() Цикл
		ГлНоваяСтрока = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(ГлНоваяСтрока,ВыборкаГлавный);
		
		СоответствиеКодовСтрок.Вставить(СокрЛП(ВыборкаГлавный.Код),ГлНоваяСтрока);
		
		Если ГлНоваяСтрока.Ссылка = ТекущееЗначениеКлассификатора Тогда
		    ИдТекущейСтроки = ГлНоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	//Форма полной классификации предназначена для выбора связанных значений.
	//В данной форме не показываем не распределенные значения, и значения, у которых отсутствует детализируемый элемент.
		
	ВыборкаДетально = РезультатыЗапроса[1].Выбрать();
	
	ЕстьДетальныеСтроки = Ложь;
	
	Пока ВыборкаДетально.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетально.ЭлементВладелецКод) Тогда
			ГлСтрока = СоответствиеКодовСтрок[СокрЛП(ВыборкаДетально.ЭлементВладелецКод)];
			Если ГлСтрока <> Неопределено Тогда
				ДетальноНоваяСтрока = ГлСтрока.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(ДетальноНоваяСтрока,ВыборкаДетально);
				
				ЕстьДетальныеСтроки = Истина;
				
				Если ДетальноНоваяСтрока.Ссылка = ТекущееЗначениеКлассификатора Тогда
				    ИдТекущейСтроки = ДетальноНоваяСтрока.ПолучитьИдентификатор();
				КонецЕсли;
		
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначениеДетализируемогоКлассификатора)
		И ЕстьДетальныеСтроки = Ложь Тогда
		Элементы.ДекорацияНетЭлементов.Видимость = Истина;
		ТекстЗаголовка = Нстр("ru='Для значения ""%1"" отсутствуют детализированные значения.'");
		Элементы.ДекорацияНетЭлементов.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка,ЗначениеДетализируемогоКлассификатора);		
	Иначе
		Элементы.ДекорацияНетЭлементов.Видимость = Ложь;
	КонецЕсли;
	
	СоответствиеКодовСтрок = Неопределено;
	
	Элементы.ДеревоЭлементов.ТекущаяСтрока = ИдТекущейСтроки;
КонецПроцедуры

&НаСервере
Функция УстановитьПометкуУдаления(ВыделенныеСтроки, ЗначениеПометки, НавигационнаяСсылкаОбъекта = Неопределено)

	Перем ПоследнийОбъект;
	
	КоличествоПомеченных = 0;
	ОбработанныеСсылки   = Новый Соответствие;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		
		ТД = ДеревоЭлементов.НайтиПоИдентификатору(Идентификатор);
		
		// Проверка, что это не корень дерева.
		Если Не ЗначениеЗаполнено(ТД.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		// Регистрация факта передачи объекта на обработку.
		КоличествоПомеченных = КоличествоПомеченных + 1;
		
		// Если фактическая обработка не требуется, то элемент пропускается.
		Если ОбработанныеСсылки[ТД.Ссылка] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		// Установка пометки на объект (и автоматическая рекурсивная пометка подчиненных)
		Объект = ТД.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(ЗначениеПометки);
				
		УстановитьПризнакПометкиВДереве(ТД, ЗначениеПометки, ОбработанныеСсылки);

		ПоследнийОбъект = ТД;
		
	КонецЦикла;

	// Заполнение параметров навигационной ссылки.
	Если Не ПоследнийОбъект = Неопределено Тогда
		локНавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ТД.Ссылка);
		ПараметрыСсылки        = Новый Структура("НавигационнаяСсылка,Текст",локНавигационнаяСсылка,ТД.Код);
		НавигационнаяСсылкаОбъекта    = ПараметрыСсылки;
	КонецЕсли;
	
	Возврат КоличествоПомеченных;
	
КонецФункции // УстановитьПометкуУдаления()

// Вспомогательная процедура обновления пометки в строках дерева.
//
&НаСервере
Процедура УстановитьПризнакПометкиВДереве(ТекущаяСтрока,ЗначениеПометки, ОбработанныеСсылки = Неопределено)

	ТекущаяСтрока.ПометкаУдаления = ЗначениеПометки;
	Если ТекущаяСтрока.ПометкаУдаления Тогда
		Если ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
			ТекущаяСтрока.ИндексКартинки = 1;
		Иначе
			ТекущаяСтрока.ИндексКартинки = 3;
		КонецЕсли;
	Иначе
		Если ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
			ТекущаяСтрока.ИндексКартинки = 0;
		Иначе
			ТекущаяСтрока.ИндексКартинки = 2;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбработанныеСсылки <> Неопределено Тогда
		ОбработанныеСсылки.Вставить(ТекущаяСтрока.Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры // УстановитьПризнакПометкиВДереве()



#КонецОбласти
